dns_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <!-- Основной Test Plan -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="DNS Load Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- Thread Group (нагрузка) -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="DNS Query Load" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.delayedStart">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- DNS-запрос к 8.8.8.8 -->
        <DNSSampler guiclass="DNSSamplerGui" testclass="DNSSampler" testname="DNS Query to 8.8.8.8" enabled="true">
          <stringProp name="DNSSampler.dns_server">8.8.8.8</stringProp>
          <stringProp name="DNSSampler.port">53</stringProp>
          <stringProp name="DNSSampler.query_class">IN</stringProp>
          <stringProp name="DNSSampler.query_type">A</stringProp>
          <stringProp name="DNSSampler.query_name">google.com</stringProp>
          <stringProp name="DNSSampler.timeout">1000</stringProp>
        </DNSSampler>
        <hashTree/>
        <!-- Слушатели (результаты) -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>